public class task05 {
//  ------------------------------------------------------------
//        Задание 5
//        Решить задачу 1, без использования циклов. Используя рекурсию.
//  ------------------------------------------------------------
    static void counter(int x) {
        if (x > 0) {
            counter(x - 1);
            System.out.println(x);
        }
    }
//  ------------------------------------------------------------
    public static void main(String[] args) {
        int X = 5;
        counter(X);
    }
//  ------------------------------------------------------------
}
