public class task01 {

    static void counter(int x) {
        for (int i = 1; i <= x; i++)
            System.out.println(i);
    }

    public static void main(String[] args) {

//        Задание 1
//        Написать функцию которая считает в консоли до числа Х.
//        Аргументы функции: число Х
//
//        Например Х = 5.
//        Вывод программы:
//        1
//        2
//        3
//        4
//        5

        int X = 5;
        counter(X);

    }
}
