public class task07 {

    public static void main(String[] args) {

//        Задание 7 (дополнительно)
//        Написать программу, в которой выполнены все шесть предыдущих заданий.
//        Каждое задание выполняется в отдельной функции.
//        В пределах этой же функции происходит ввод с консоли необходимых данных.
//        Программа спрашивает у пользователя какую задачу он хочет решить (от 1 до 6).
//        Затем программа вызывает соответствующую функцию для решения этой задачи.
//        По окончанию решения задачи, программа спрашивает пользователя, хочет ли он продолжить решать задачи.
//        Если да - опять спрашивает какую задачу

    }
}
